"""a = {"Ахмад": 893435675, "Дионис": 739450430}
print(a)
a["Дионис"] = [739450430 , 74346597]
print(a)
del a["Дионис"]
print(a)
minecraft = {"Инструменты": ["Кирка", "Топор", "Лопата"], "Еда": ["Хлеб", "Морковь"], "Броня": "Железная"}
print(minecraft["Инструменты"][0])
print(minecraft["Инструменты"][1])
print(minecraft["Инструменты"][2])
print(minecraft["Еда"][0])
print(minecraft["Еда"][1])
print(minecraft["Броня"])"""
a = {"Животный":["Жираф", "Слон", "Тигр", "Волк"],"Насекомые": ["Богомол", "Стрекоза", "Муха"], "Рыбы": ["Дельфин", "Акула"], "Вид":["Фауна"]}
print(a)
print(a["Животный"][1], a["Насекомые"][1], a["Рыбы"][1])
a["Рыбы"]=["Дельфин", "Акула", "Кит"]
print(a)
a["Насекомые"]=["Пчела", "Оса"]
print(a)
a["Рыбы"].append("Лосось")
print(a)
