"""#Пользователь создает список длиной n, где n - число, которое пользователь ввёл с клавиатуры. С помощью цикла for создать его зеркальную копию (отразить список)
n = int(input("Введите длину списка: "))
a = []
for i in range(n):
    a.append(input("Введите любое значение: "))
print(a)
r = []
for i in range(len(a)):
    r.append(a.pop(-1))
print(r)"""
a = ["f", "fg", "gf", "h"]
n = int(input("Введите количество элементов: "))
for i in range(n):
    if len(a) % 2 == 0:
        a = a[:len(a)//2] + [input("Введите любое значение: ")] + a[len(a)//2:]
#print(a)
    elif len(a) % 2 == 1:
        a = a[:len(a)//2 + 1] + [input("Введите любое значение: ")] + a[len(a)//2 + 1:]
print(a)