# Список - изменяемый набор элементов
a = ["Хлеб", "Молоко", "Шоколад", 23, 27.5, True]
print(a)
# Кортеж - неизменяемый набор элементов
c = ("Хлеб", "Молоко", "Шоколад", 23, 27.5, True)
print(c)
# Изменение элемента
a[1] = "Булка"
print(a)
'''# Как сделать из номера индекс
i = int(input("Введите номер элемента, который хотите сделать машиной "))
a[i-1] = "Машина"'''
print(a)
# Добавить элемент с помощью метода .append()
a.append("Чипсы")
print(a)
# Добавить элемент с помощью сложения
a = a[:3] + ["Кока кола"] + a[3:]
print(a)
# Удаление элемента
del a[2]
print(a)
# Забрать элемент из списка
pocket = a.pop(1)
print(a)
print(pocket)
