# цикл for - работает в диапазоне
# for "локальная переменная" in диапазон:
#     действия

# range(начало, конец, шаг)
print(list(range(9)))
print(list(range(91, 0, -2)))

# Использование range в цикле, счёт суммы
s = 1
for work in range(1, 5):
    s += work + 1
print(s)

# Списки в качестве диапазонов
bread = ["Лаваш", "Шаурма", "Буханка", "Чебурек"]
for i in bread:
    print(i)

# Длина списков в качестве диапазонов
bread = ["Лаваш", "Лаваш","Лаваш","Лаваш", "Шаурма", "Буханка",  "Лаваш",  "Лаваш",  "Лаваш", "Чебурек"]
bread.sort() # Сортировка списка
for i in range(len(bread)-1):
    if bread[i] == bread[i+1]:
     print("Да")